## Topic: 2. Adding new column and saving to local storage.

### OUTCOMES

- 1. Add a Column with constant value

- 2. Add a Column with some Mathematical Operations 

- 3. Add a New column with condition (np.where)

- 4. Add a New column with spliting data.

- 5. Saving the DataFrame to Local Storage.

In [2]:
import pandas as pd

In [30]:
df = pd.read_csv("student_data.csv")
df.head(2)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram

### 1. Add a Column with constant value

- Syntax : Add a column with constant value
    - df["New_column_name"] = constant value

In [8]:
df["Country"] = 'Bangladesh'
df.head(3)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location,Country
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka,Bangladesh
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram,Bangladesh
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka,Bangladesh

### 2. Add a Column with some Mathematical Operations

- syntax:
    - df["new_coln_name"] = df["col1"] + df["col2"] + ...

In [11]:
df["Total Marks"] = df['Python Marks'] + df['Data Structure Marks'] + df['Algorithm Marks']

df.head(2)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location,Country,Total Marks
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka,Bangladesh,258.0
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram,Bangladesh,NaN

In [ ]:
df["Total Marks"].head(8)

# NOTE 
# if one column of (Python Marks,Data Structure Marks, Algorithm Marks) contain NaN value then Total Marks count only NaN value (not sum)

0    258.0
1      NaN
2    261.0
3    238.0
4      NaN
5    228.0
6      NaN
7    247.0
Name: Total Marks, dtype: float64

### 3. Add a New column with condition (np.where)

In [ ]:
# using numpy function [ np.where() ]
import numpy as np

df["A+ in Python"] = np.where(df['Python Marks']>80, 'A+', 'A')

df.head(10)


# if Python Marks is greater than 90 then -> A+ else A

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location,Country,Total Marks,A+ in Python
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka,Bangladesh,258.0,A+
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram,Bangladesh,NaN,A
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka,Bangladesh,261.0,A+
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet,Bangladesh,238.0,A+
4,PH1005,Kamal Uddin,NaN,NaN,95.0,In Progress,2024-03-05,Mr. Karim,Chattogram,Bangladesh,NaN,A+
5,PH1006,Laila Begum,75.0,75.0,78.0,Completed,2024-03-08,Ms. Salma,Rajshahi,Bangladesh,228.0,A
6,PH1007,Mahmudul Hasan,80.0,80.0,NaN,In Progress,2024-04-01,Mr. Karim,Dhaka,Bangladesh,NaN,A
7,PH1008,Nadia Islam,81.0,81.0,85.0,Completed,2024-04-22,Ms. Salma,Chattogram,Bangladesh,247.0,A+
8,PH1009,Omar Faruq,72.0,72.0,76.0,Completed,2024-05-16,Mr. David,Dhaka,Bangladesh,220.0,A
9,PH1010,Priya Sharma,89.0,89.0,88.0,Completed,2024-05-20,Ms. Salma,Sylhet,Bangladesh,266.0,A+

### 4. Add a New column with spliting data.

In [ ]:
# add a new colun with First name

df['FirstName'] = df['FullName'].str.split(' ').str[0]
df.head(3)

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location,Country,Total Marks,A+ in Python,FirstName
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka,Bangladesh,258.0,A+,Alif
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram,Bangladesh,NaN,A,Fatima
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka,Bangladesh,261.0,A+,Imran

In [ ]:
# add a new data with last name
df['Last_Name'] = df['FullName'].str.split(' ').str[1]
df.head(2)

# here, split by space

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location,Country,Total Marks,A+ in Python,FirstName,Last_Name
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka,Bangladesh,258.0,A+,Alif,Rahman
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram,Bangladesh,NaN,A,Fatima,Akhter

In [42]:
import pandas as pd

df1 = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie"],
    "salary": [50000, 60000, 55000]
})

# Add a constant column
df1["country"] = "Bangladesh"
print(df1)

      name  salary     country
0    Alice   50000  Bangladesh
1      Bob   60000  Bangladesh
2  Charlie   55000  Bangladesh

In [ ]:
# new column add with customize value

df1["email"] = ["alice@gmail.com", "bob@yahoo.com", "charlie@outlook.com"]

In [ ]:
df1 = df1[['username', 'domain']] = df1['email'].str.split('@', expand = True)

df1.head(3)

# str.split("@", expand=True) splits the string into two parts.

# expand=True returns multiple columns.

         0            1 username       domain
0    alice    gmail.com    alice    gmail.com
1      bob    yahoo.com      bob    yahoo.com
2  charlie  outlook.com  charlie  outlook.com

In [ ]:

# Split email into username and domain
df1[["username", "domain"]] = df1["email"].str.split("@", expand=True)
print(df1)

      name  salary     country                email username       domain
0    Alice   50000  Bangladesh      alice@gmail.com    alice    gmail.com
1      Bob   60000  Bangladesh        bob@yahoo.com      bob    yahoo.com
2  Charlie   55000  Bangladesh  charlie@outlook.com  charlie  outlook.com

### 5. Saving the DataFrame to Local Storage.

In [ ]:
# To check it's change in internal or not

df2 = pd.read_csv("student_data.csv")

df2.head(2)

# There is no change

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram

In [ ]:
# To change or create a new csv file 

# syntax: df.to_filetype('new_file_name')

# for csv file: df.to_csv("new_student_data.csv")

In [49]:
df.to_csv("new_student_data.csv")

In [50]:
update_df = pd.read_csv("new_student_data.csv")
update_df.head(3)

,Unnamed: 0,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location,First_name,Lst_name
0,0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka,Alif,Rahman
1,1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram,Fatima,Akhter
2,2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka,Imran,Hossain